#1 Задание. Вычислить число c заданной точностью d
# при $d = 0.001, π = 3.141.$ 

import math 
num = 25.74356801 

print("%.3f" % (num))



#2 Задание. Задайте натуральное число N. Напишите программу,
#  которая составит список простых множителей числа N.

# i=2
# n = 200

# while n != i:

#     while n % i == 0:
#         print(i)
#         n = n/ i
#     i+=1

# else:
#     print(n)


